In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 
    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [4]:
def fillMissingValuesInFlightNumber(flightNumber):
    global prevFlightNumber
    if np.isnan(flightNumber):
        prevFlightNumber += 10
        return prevFlightNumber
    else:
        prevFlightNumber = flightNumber
        return flightNumber

In [5]:
prevFlightNumber = 0
df.FlightNumber = df.FlightNumber.apply(fillMissingValuesInFlightNumber)

In [6]:
df.FlightNumber = df.FlightNumber.astype(int)

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [8]:
def splitFromTo(columnValue):
     return columnValue.split("_")

In [9]:
dfFromTo = pd.DataFrame()

In [10]:
dfFromTo['From'], dfFromTo['To'] = zip(*df.From_To.apply(splitFromTo))

In [11]:
dfFromTo

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [12]:
def upperCaseCityNames(name):
    return name.capitalize()

In [13]:
dfFromTo.From = dfFromTo.From.apply(upperCaseCityNames)

In [14]:
dfFromTo.To = dfFromTo.To.apply(upperCaseCityNames)

In [15]:
dfFromTo

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [16]:
df.drop('From_To', axis = 'columns', inplace=True)
df = df.join(dfFromTo)

In [17]:
del dfFromTo

In [18]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5.In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [94]:
delays = pd.DataFrame()

In [97]:
def splitRecentDelays(delayList):
    print(delayList)
    if delayList is not None:
        for value in range(len(delayList)):
            delays['delay_'+ str(value)] = delayList[value]

In [98]:
delays = df.RecentDelays.apply(splitRecentDelays)

[23, 47]
[]
[24, 43, 87]
[13]
[67, 32]

In [99]:
delays

0    None
1    None
2    None
3    None
4    None
Name: RecentDelays, dtype: object